In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame({
    "Mileage": [69000, 35000, 57000, 22500, 46000],
    "Age(yrs)": [6, 3, 5, 2, 4],
    "Sell Price($)": [18000, 34000, 26100, 40000, 31500]
})

In [5]:
X = df[['Mileage','Age(yrs)']]

In [6]:
y = df['Sell Price($)']

In [7]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2)

In [8]:
X_train

   Mileage  Age(yrs)
3    22500         2
4    46000         4
0    69000         6
1    35000         3

In [9]:
X_test

   Mileage  Age(yrs)
2    57000         5

In [10]:
y_train

3    40000
4    31500
0    18000
1    34000
Name: Sell Price($), dtype: int64

In [11]:
y_test

2    26100
Name: Sell Price($), dtype: int64